app/Models/UsuariosModel.php

SELECT `id`, `nome`, `usuario`, `email`, `is_admin`
FROM `usuarios`
---
    public function buscarUsuarios():array
    {
        return $this->select('id, nome, usuario, email, is_admin')->findAll();

INSERT INTO `usuarios` (`nome`, `usuario`, `senha`, `email`, `is_admin`) VALUES ('bruno', 'bruno', '$2y$10$HBHketBkwK8ejAbqwNPLFu2m3aqtKbFKhOqRoYedL2qmwuHmxLsHq', 'bruno@teste.com', '1')
---
    public function criarUsuario($usuario):bool
    {
        return $this->insert($usuario);

UPDATE `usuarios` SET `nome` = 'Usuario Admin', `usuario` = 'usuario1', `email` = 'usuario1@exemplo.com.br', `is_admin` = '1'
WHERE `usuarios`.`id` IN ('1')
---
    public function editarUsuario($id, $usuario):bool
    {
        return $this->update($id, $usuario);